//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c) 1999 - 2012 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// 
// 
// Module Name:
//
//   OtherSvSetup.uni
// 
// Abstract:
// 
//   String definitions for Other Sv
// 
// Revision History:
// 
// --*/

/=#
#langdef   en-US "English"

#string STR_RESET_TESTING_FORM                        #language en-US "Non-Silicon Specific Items"
#string STR_RESET_TESTING_HELP                        #language en-US "Non-Silicon Specific Menu"


#string STR_RESETTESTING_FORM                   #language en-US "ResetTesting"
#string STR_STR_RESETTESTING_HELP               #language en-US "All SV reset testing options"

#string STR_VALIDATION_RESET_TYPE_PROMPT        #language en-US "Reset Type"
#string STR_VALIDATION_RESET_TYPE_HELP          #language en-US "Option for forcing reset testing based on reset type selected"
#string STR_PWRGD_RST_SS                        #language en-US "Power Good S-S"
#string STR_NORMAL_SF_FF_HRDRST                 #language en-US "Normal S-F (F-F) HRDRST"

#string STR_VALIDATION_COUNT_OUTER_PROMPT       #language en-US "Outer Counter"
#string STR_VALIDATION_COUNT_OUTER_HELP         #language en-US "Applies to OUTER or only cycle item in specification. Specified as S-S, S-F, or F-F"
#string STR_VALIDATION_COUNT_INNER_PROMPT       #language en-US "Inner Count"
#string STR_VALIDATION_COUNT_INNER_HELP         #language en-US "Selects the inner cycle item in specification. Specificed as (F-F)"

#string STR_1                                   #language en-US "1"
#string STR_10                                  #language en-US "10"
#string STR_20                                  #language en-US "20"
#string STR_100                                 #language en-US "100"
#string STR_500                                 #language en-US "500"
#string STR_1000                                #language en-US "1000"
#string STR_5000                                #language en-US "5000"
#string STR_10000                               #language en-US "10000"
#string STR_INFINITE                            #language en-US "Infinite"

#string STR_NULL_STRING                         #language en-US ""
#string STR_NONE                                #language en-US  "None"
#string STR_HORIZONTAL_LINE             #language en-US "--------------------------------------------------"
#string STR_NONE                                #language en-US "None"
#string STR_MIDBUS                              #language en-US "Midbus"
#string STR_NO                                  #language en-US "No"
#string STR_YES                                 #language en-US "Yes"
#string STR_CSI_AUTO                            #language en-US "Auto"

#string STR_VALIDATION_SOE_PROMPT               #language en-US "Stop on Error?"
#string STR_VALIDATION_SOE_HELP                 #language en-US "Do you want the reset cycling to stop cycling on errors?"
#string STR_VALIDATION_BWD_PROMPT               #language en-US "Boot When Test Completes?"
#string STR_VALIDATION_BWD_HELP                 #language en-US "Do you want the system to boot the OS when the testing completes?"

#string STR_VALIDATION_PROC_PCI_PROMPT                               #language en-US "Check PROC PCI errors?"
#string STR_VALIDATION_PROC_PCI_HELP                                 #language en-US "Do you want the reset cycling to check for PCI errors on PROC PCIe devices/ports?"
#string STR_VALIDATION_PROC_PCI_LINK_PROMPT                          #language en-US "Check PCI Link errors?"
#string STR_VALIDATION_PROC_PCI_LINK_HELP                            #language en-US "Do you want the reset cycling to check for PCI link errors on PROC PCIe devices/ports?"
#string STR_VALIDATION_PROC_PCI_LINK_RECOVERY_COUNT_PROMPT           #language en-US "Check PROC PCI Recoveries?"
#string STR_VALIDATION_PROC_PCI_LINK_RECOVERY_COUNT_HELP             #language en-US "Do you want the reset cycling to check for PCI link recoveries in excess of the threshold?"
#string STR_VALIDATION_PROC_PCI_LINK_RECOVERY_COUNT_THRESHOLD_PROMPT #language en-US "Link Recovery Threshold?"
#string STR_VALIDATION_PROC_PCI_LINK_RECOVERY_COUNT_THRESHOLD_HELP   #language en-US "Sets threshold for PCI link recovery"
#string STR_VALIDATION_PCH_PCI_PROMPT                               #language en-US "Check Pch PCI errors?"
#string STR_VALIDATION_PCH_PCI_HELP                                 #language en-US "Do you want the reset cycling to check for PCI errors on PCH PCIe devices/ports?"
#string STR_VALIDATION_PROC_PCI_LINK_RECOVERY_COUNT_PROMPT           #language en-US "Check PROC PCI Recoveries?"
#string STR_VALIDATION_KTI_PROMPT                                   #language en-US "Check Kti errors?"
#string STR_VALIDATION_KTI_HELP                                     #language en-US "Do you want the reset cycling to check for KTI link failures?"



